In [2]:
import pandas as pd

In [4]:
data = pd.read_excel(r'C:\Users\Azeez Sharieff\Documents\data files for practice\Book1.xlsx')
data

    Name  Btch No  Score    ID
0  Allen       34     45  1234
1    Bob       34     42  2345
2  Suzan       34     40   678
3  Allex       34     43   908

In [5]:
data2 = pd.read_csv(r'C:\Users\Azeez Sharieff\Documents\data files for practice\Book1.csv')
data2

    Name  Btch No  Score    ID
0  Allen       34     45  1234
1    Bob       34     42  2345
2  Suzan       34     40   678
3  Allex       34     43   908

In [18]:
data3 = pd.read_csv(r'C:\Users\Azeez Sharieff\Documents\data files for practice\data3.tsv')
data3

   Name   Salary   ID
0  Allex   43000   23
1  Suzan   45000   34
2    Bob   44000   56